import streamlit as st

st.title("Тест по География и История")
st.write("Отговорете на въпросите и проверете знанията си.")

score = 0

q1 = st.radio(
    "1. Коя е най-дългата река в света?",
    ["Амазонка", "Нил", "Мисисипи"],
    key="q1"
)

q2 = st.radio(
    "2. През коя година е основана българската държава?",
    ["632 г.", "681 г.", "1018 г."],
    key="q2"
)

q3 = st.radio(
    "3. Кой е най-високият връх на Балканския полуостров?",
    ["Вихрен", "Олимп", "Мусала"],
    key="q3"
)

q4 = st.radio(
    "4. Кой е известен като Апостола на свободата?",
    ["Христо Ботев", "Васил Левски", "Георги Раковски"],
    key="q4"
)

q5 = st.radio(
    "5. Кой е най-големият океан на Земята?",
    ["Атлантически", "Индийски", "Тихи"],
    key="q5"
)

if st.button("Провери резултата"):
    if q1 == "Нил":
        score += 1
    
    if q2 == "681 г.":
        score += 1
        
    if q3 == "Мусала":
        score += 1
        
    if q4 == "Васил Левски":
        score += 1
        
    if q5 == "Тихи":
        score += 1

    if score == 5:
        st.success(f"Резултат: {score}/5. Всички отговори са верни.")
    elif score >= 3:
        st.info(f"Резултат: {score}/5. Добър опит.")
    else:
        st.error(f"Резултат: {score}/5. Опитайте отново.")
